Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.master_vm will be created
+ resource "yandex_compute_instance" "master_vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "master"
      + id                        = (known after apply)
      + metadata                  = {
          + "serial-port-enable" = "1"
          + "user-data"          = <<-EOT
                #cloud-config
                groups:
                  - admingroup: [root,sys]
                users:
                  - name: evgen
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    passwd: 123123
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDe5Kxg97NqW+7sO7DB5wDDm8zWl20w9TYlR6YTHmfO4SRBTQYQFeX32Q2m2HsLq6nxHsL3A43mCrI//HUk3G8gWGwZSgHRjG0fn5bsrDZ3avIL0xxdKzbDR6FSSocod1gpxEQr5HX45eVjv2lBUsw2ACxNwAI3crEyLJwbB0iva8QVEELSUKghAgidNR38LJE6hvQhxGZJR8Y4cN9EiCyCFTj5hXyMEGDPRaUPzCaAfwOAdpxowR960HLgRTv6XlWm6RqpIP76Jf94yNVTWbtKnJIWUA8f2763Cdmg0gFsKwcJtP0XIdUx1T/ZQZ5YPzGmjAWJyjiX2DzgSwelGvPGEmHnU0gqcEP7nX+/8NxYfF3Im53wIROlazlW6vY81CuJj+nRarC8XzepRZPmFhI7F5f7FBfaNfNPfzZmyUg619BJ9Jo1jn3nItnMoFVITifFUMi8x+byKwhhKoQcpWOAT1TV+r4QbuV+aovpciAp1iSjxllwAGosFWdCq1ve5M0= evgen@evgen-vb
            EOT
        }
      + name                      = "master"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8jvcoeij6u9se84dt5"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_compute_instance.node1_vm will be created
+ resource "yandex_compute_instance" "node1_vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node1"
      + id                        = (known after apply)
      + metadata                  = {
          + "serial-port-enable" = "1"
          + "user-data"          = <<-EOT
                #cloud-config
                groups:
                  - admingroup: [root,sys]
                users:
                  - name: evgen
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    passwd: 123123
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDe5Kxg97NqW+7sO7DB5wDDm8zWl20w9TYlR6YTHmfO4SRBTQYQFeX32Q2m2HsLq6nxHsL3A43mCrI//HUk3G8gWGwZSgHRjG0fn5bsrDZ3avIL0xxdKzbDR6FSSocod1gpxEQr5HX45eVjv2lBUsw2ACxNwAI3crEyLJwbB0iva8QVEELSUKghAgidNR38LJE6hvQhxGZJR8Y4cN9EiCyCFTj5hXyMEGDPRaUPzCaAfwOAdpxowR960HLgRTv6XlWm6RqpIP76Jf94yNVTWbtKnJIWUA8f2763Cdmg0gFsKwcJtP0XIdUx1T/ZQZ5YPzGmjAWJyjiX2DzgSwelGvPGEmHnU0gqcEP7nX+/8NxYfF3Im53wIROlazlW6vY81CuJj+nRarC8XzepRZPmFhI7F5f7FBfaNfNPfzZmyUg619BJ9Jo1jn3nItnMoFVITifFUMi8x+byKwhhKoQcpWOAT1TV+r4QbuV+aovpciAp1iSjxllwAGosFWdCq1ve5M0= evgen@evgen-vb
            EOT
        }
      + name                      = "node1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8jvcoeij6u9se84dt5"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_compute_instance.node2_vm will be created
+ resource "yandex_compute_instance" "node2_vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "node2"
      + id                        = (known after apply)
      + metadata                  = {
          + "serial-port-enable" = "1"
          + "user-data"          = <<-EOT
                #cloud-config
                groups:
                  - admingroup: [root,sys]
                users:
                  - name: evgen
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    passwd: 123123
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDe5Kxg97NqW+7sO7DB5wDDm8zWl20w9TYlR6YTHmfO4SRBTQYQFeX32Q2m2HsLq6nxHsL3A43mCrI//HUk3G8gWGwZSgHRjG0fn5bsrDZ3avIL0xxdKzbDR6FSSocod1gpxEQr5HX45eVjv2lBUsw2ACxNwAI3crEyLJwbB0iva8QVEELSUKghAgidNR38LJE6hvQhxGZJR8Y4cN9EiCyCFTj5hXyMEGDPRaUPzCaAfwOAdpxowR960HLgRTv6XlWm6RqpIP76Jf94yNVTWbtKnJIWUA8f2763Cdmg0gFsKwcJtP0XIdUx1T/ZQZ5YPzGmjAWJyjiX2DzgSwelGvPGEmHnU0gqcEP7nX+/8NxYfF3Im53wIROlazlW6vY81CuJj+nRarC8XzepRZPmFhI7F5f7FBfaNfNPfzZmyUg619BJ9Jo1jn3nItnMoFVITifFUMi8x+byKwhhKoQcpWOAT1TV+r4QbuV+aovpciAp1iSjxllwAGosFWdCq1ve5M0= evgen@evgen-vb
            EOT
        }
      + name                      = "node2"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8jvcoeij6u9se84dt5"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_iam_service_account_static_access_key.sa-static-key will be created
+ resource "yandex_iam_service_account_static_access_key" "sa-static-key" {
      + access_key           = (known after apply)
      + created_at           = (known after apply)
      + description          = "static access key for object storage"
      + encrypted_secret_key = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret_key           = (sensitive value)
      + service_account_id   = "ajemtk9h8g4aqcqa9ncv"
    }

  # yandex_storage_bucket.test will be created
+ resource "yandex_storage_bucket" "test" {
      + access_key            = (known after apply)
      + acl                   = "private"
      + bucket                = "terraform-bucket-diplom"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags {
          + list = (known after apply)
          + read = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }
    }

  # yandex_vpc_network.vpc_diplom will be created
+ resource "yandex_vpc_network" "vpc_diplom" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "vpc_diplom"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.master_sub will be created
+ resource "yandex_vpc_subnet" "master_sub" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "master_sub"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.129.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.node_sub will be created
+ resource "yandex_vpc_subnet" "node_sub" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "node_sub"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.130.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ master_ip = (known after apply)
+ node1_ip  = (known after apply)
+ node2_ip  = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://a6b2-146-70-111-178.eu.ngrok.io/lock?id=Evgeniy-Nikolskiy%252Fdiplom-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
